#3. Пользователь вводит месяц в виде целого числа от 1 до 12.
# Сообщить к какому времени года относится месяц (зима, весна, лето, осень).
# Напишите решения через list и через dict.

my_list = ["зима", "весна", "лето", "осень"]
my_dict = {1:"зима", 2:"зима", 12:"зима",
           3:"весна", 4:"весна", 5:"весна",
           6:"лето", 7:"лето", 8:"лето",
           9:"осень", 10:"осень", 11:"осень" }
num = 0
month = int(input("Введите месяц в виде целого числа : "))
print(month)
if month == 1 or month == 2 or month == 12:
    num = 0
if month == 3 or month == 4 or month == 5:
    num = 1
if month == 6 or month == 7 or month == 8:
    num = 2
if month == 9 or month == 10 or month == 11:
    num = 3
print("Список", my_list[num])
print ("Словарь", my_dict[month])


